
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 39 to add, 14 to change, 9 to destroy.</code></pre>

* Create
  * azurerm_dev_test_global_vm_shutdown_schedule.dtgtwyvm[0]
  * azurerm_dev_test_global_vm_shutdown_schedule.dtgtwyvm[1]
  * azurerm_key_vault_access_policy.appreg_access
  * azurerm_key_vault_secret.POSTGRES_PASS
  * azurerm_key_vault_secret.POSTGRES_USER
  * azurerm_managed_disk.dtgtwaydatadisk[0]
  * azurerm_managed_disk.dtgtwaydatadisk[1]
  * azurerm_network_interface.dtgwnic[1]
  * azurerm_private_dns_zone_virtual_network_link.postgres_dg
  * azurerm_private_endpoint.finalsa
  * azurerm_private_endpoint.ingestsa
  * azurerm_private_endpoint.sa
  * azurerm_route_table.postgres
  * azurerm_subnet_route_table_association.dg_subnet
  * azurerm_virtual_machine_data_disk_attachment.dtgtwy[0]
  * azurerm_virtual_machine_data_disk_attachment.dtgtwy[1]
  * azurerm_virtual_machine_extension.dtgtwayvmextension[0]
  * azurerm_virtual_machine_extension.dtgtwayvmextension[1]
  * azurerm_virtual_machine_extension.dtgtwydaa-agent[0]
  * azurerm_virtual_machine_extension.dtgtwydaa-agent[1]
  * azurerm_virtual_machine_extension.dtgtwymonitor-agent[0]
  * azurerm_virtual_machine_extension.dtgtwymonitor-agent[1]
  * azurerm_virtual_machine_extension.dtgtwymsmonitor-agent[0]
  * azurerm_virtual_machine_extension.dtgtwymsmonitor-agent[1]
  * azurerm_virtual_network_peering.from_hub
  * azurerm_virtual_network_peering.to_hub
  * azurerm_windows_virtual_machine.dtgtwyvm[0]
  * azurerm_windows_virtual_machine.dtgtwyvm[1]
  * module.data_store_db_v14.azurerm_postgresql_flexible_server.pgsql_server
  * module.data_store_db_v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.data_store_db_v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.data_store_db_v14.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.data_store_db_v14.azurerm_postgresql_flexible_server_database.pg_databases[&#34;pre-pdb-stg&#34;]
  * module.data_store_db_v14.null_resource.set-user-permissions-additionaldbs[0]
  * module.data_store_db_v14.random_password.password
  * module.dynatrace-oneagent-dtgtway[0].azurerm_virtual_machine_extension.dynatrace-oneagent[0]
  * module.dynatrace-oneagent-dtgtway[1].azurerm_virtual_machine_extension.dynatrace-oneagent[0]
* Update
  * azapi_update_resource.ams_auth
  * azurerm_monitor_diagnostic_setting.storageblobfinalsa
  * azurerm_monitor_diagnostic_setting.storageblobingestsa
  * azurerm_monitor_diagnostic_setting.storageblobsa
  * azurerm_public_ip.pip
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.key-vault.azurerm_key_vault.kv
  * module.key-vault.azurerm_key_vault_access_policy.developer[0]
  * module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sa_storage_account.azurerm_storage_account.storage_account
  * module.vm_automation.azurerm_automation_schedule.vm-start-stop[&#34;vm-off&#34;]
  * module.vm_automation.azurerm_automation_schedule.vm-start-stop[&#34;vm-on&#34;]
* Delete
  * azurerm_media_transform.EncodeToMP402
  * azurerm_media_transform.analysevideo02
  * null_resource.amsid_02
  * module.finalsa02_storage_account.random_string.storage_account_random_string
  * module.ingestsa02_storage_account.random_string.storage_account_random_string
  * module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop[&#34;vm-off&#34;]
  * module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop[&#34;vm-on&#34;]
* Replace
  * azurerm_key_vault_access_policy.devops_access
  * null_resource.amsid


<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_update_resource.ams_auth will be updated in-place
  ~ resource "azapi_update_resource" "ams_auth" {
      ~ body                    = jsonencode(
          ~ {
              ~ properties = {
                  ~ storageAccounts       = [
                      ~ {
                          ~ id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
                          ~ identity = {
                              ~ useSystemAssignedIdentity = false -> "false"
                                # (1 unchanged element hidden)
                            }
                          ~ type     = "Secondary" -> "Primary"
                        },
                      ~ {
                          ~ id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
                          ~ identity = {
                              ~ useSystemAssignedIdentity = false -> "false"
                                # (1 unchanged element hidden)
                            }
                          ~ type     = "Primary" -> "Secondary"
                        },
                    ]
                    # (1 unchanged element hidden)
                }
            }
        )
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preamsstg"
        name                    = "preamsstg"
      ~ output                  = jsonencode({}) -> (known after apply)
      ~ type                    = "Microsoft.Media/mediaservices@2021-06-01" -> "Microsoft.Media/mediaservices@2021-05-01"
        # (4 unchanged attributes hidden)
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.dtgtwyvm[0] will be created
  + resource "azurerm_dev_test_global_vm_shutdown_schedule" "dtgtwyvm" {
      + daily_recurrence_time = "1800"
      + enabled               = true
      + id                    = (known after apply)
      + location              = "uksouth"
      + tags                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + timezone              = "GMT Standard Time"
      + virtual_machine_id    = (known after apply)

      + notification_settings {
          + enabled         = false
          + time_in_minutes = 30
        }
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.dtgtwyvm[1] will be created
  + resource "azurerm_dev_test_global_vm_shutdown_schedule" "dtgtwyvm" {
      + daily_recurrence_time = "1800"
      + enabled               = true
      + id                    = (known after apply)
      + location              = "uksouth"
      + tags                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + timezone              = "GMT Standard Time"
      + virtual_machine_id    = (known after apply)

      + notification_settings {
          + enabled         = false
          + time_in_minutes = 30
        }
    }

  # azurerm_key_vault_access_policy.appreg_access will be created
  + resource "azurerm_key_vault_access_policy" "appreg_access" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + object_id          = "1043d250-96eb-4cc3-af11-3215cfbf028f"
      + secret_permissions = [
          + "List",
          + "Get",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_access_policy.devops_access must be replaced
-/+ resource "azurerm_key_vault_access_policy" "devops_access" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/64e5c2d9-c957-4038-873f-7eb4e6250c7d" -> (known after apply)
      ~ object_id               = "64e5c2d9-c957-4038-873f-7eb4e6250c7d" -> "a0c6507c-299c-4f46-96c6-8275d2c45242" # forces replacement
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PASS" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "postgres-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "postgres-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_managed_disk.dtgtwaydatadisk[0] will be created
  + resource "azurerm_managed_disk" "dtgtwaydatadisk" {
      + create_option                 = "Empty"
      + disk_encryption_set_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/diskEncryptionSets/pre-des"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1000
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "predtgtwy0-datadisk-stg"
      + public_network_access_enabled = true
      + resource_group_name           = "pre-stg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + tier                          = (known after apply)
      + zone                          = "2"
    }

  # azurerm_managed_disk.dtgtwaydatadisk[1] will be created
  + resource "azurerm_managed_disk" "dtgtwaydatadisk" {
      + create_option                 = "Empty"
      + disk_encryption_set_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/diskEncryptionSets/pre-des"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1000
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "predtgtwy1-datadisk-stg"
      + public_network_access_enabled = true
      + resource_group_name           = "pre-stg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + tier                          = (known after apply)
      + zone                          = "2"
    }

  # azurerm_media_transform.EncodeToMP402 will be destroyed
  # (because azurerm_media_transform.EncodeToMP402 is not in configuration)
  - resource "azurerm_media_transform" "EncodeToMP402" {
      - description                 = "Encode To MP4" -> null
      - id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preams02stg/transforms/EncodeToMP4" -> null
      - media_services_account_name = "preams02stg" -> null
      - name                        = "EncodeToMP4" -> null
      - resource_group_name         = "pre-stg" -> null

      - output {
          - on_error_action   = "ContinueJob" -> null
          - relative_priority = "Normal" -> null

          - builtin_preset {
              - preset_name = "H264SingleBitrate1080p" -> null
            }
        }
    }

  # azurerm_media_transform.analysevideo02 will be destroyed
  # (because azurerm_media_transform.analysevideo02 is not in configuration)
  - resource "azurerm_media_transform" "analysevideo02" {
      - description                 = "Analyse Video" -> null
      - id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preams02stg/transforms/AnalyseVideos" -> null
      - media_services_account_name = "preams02stg" -> null
      - name                        = "AnalyseVideos" -> null
      - resource_group_name         = "pre-stg" -> null

      - output {
          - on_error_action   = "ContinueJob" -> null
          - relative_priority = "Normal" -> null

          - builtin_preset {
              - preset_name = "H264SingleBitrate1080p" -> null
            }
        }
    }

  # azurerm_monitor_diagnostic_setting.storageblobfinalsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobfinalsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg/blobServices/default|prefinalsastg"
        name                       = "prefinalsastg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobingestsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobingestsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg/blobServices/default|preingestsastg"
        name                       = "preingestsastg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg/blobServices/default|presastg"
        name                       = "presastg"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_network_interface.dtgwnic[1] will be created
  + resource "azurerm_network_interface" "dtgwnic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "pre-dtgwnic1-stg"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "pre-stg"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg"
        }
    }

  # azurerm_private_dns_zone_virtual_network_link.postgres_dg will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "postgres_dg" {
      + id                    = (known after apply)
      + name                  = "pre-stg-virtual-network-link"
      + private_dns_zone_name = "private.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + virtual_network_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg"
    }

  # azurerm_private_endpoint.finalsa will be created
  + resource "azurerm_private_endpoint" "finalsa" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "prefinalsa-pe-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prefinalsa-psc-stg"
          + private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_private_endpoint.ingestsa will be created
  + resource "azurerm_private_endpoint" "ingestsa" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "prestream-pe-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "pre-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/provi

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

8674665223082153551" -> null
    }

  # module.data_store_db_v14.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "psqladmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "pre-db-stg"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "pre-stg"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 32768
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "application"         = "pre-recorded-evidence"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + version                       = "14"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }
    }

  # module.data_store_db_v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "pre-stg"
      + server_name         = "pre-db-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_store_db_v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + principal_name      = "jenkins-ptl-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "pre-stg"
      + server_name         = "pre-db-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_store_db_v14.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.data_store_db_v14.azurerm_postgresql_flexible_server_database.pg_databases["pre-pdb-stg"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "pre-pdb-stg"
      + server_id = (known after apply)
    }

  # module.data_store_db_v14.null_resource.set-user-permissions-additionaldbs[0] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS SDS DB Access Reader"
          + "name"           = "pre-db"
          + "script_hash"    = "595fbf4e691cebf06b94cc89e8a8e70cccb31c50dbdd0923cec978b066f3ebe9"
        }
    }

  # module.data_store_db_v14.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.dynatrace-oneagent-dtgtway[0].azurerm_virtual_machine_extension.dynatrace-oneagent[0] will be created
  + resource "azurerm_virtual_machine_extension" "dynatrace-oneagent" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "Dynatrace"
      + publisher                   = "dynatrace.ruxit"
      + settings                    = (sensitive value)
      + type                        = "oneAgentWindows"
      + type_handler_version        = "2.3"
      + virtual_machine_id          = (known after apply)
    }

  # module.dynatrace-oneagent-dtgtway[1].azurerm_virtual_machine_extension.dynatrace-oneagent[0] will be created
  + resource "azurerm_virtual_machine_extension" "dynatrace-oneagent" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "Dynatrace"
      + publisher                   = "dynatrace.ruxit"
      + settings                    = (sensitive value)
      + type                        = "oneAgentWindows"
      + type_handler_version        = "2.3"
      + virtual_machine_id          = (known after apply)
    }

  # module.finalsa02_storage_account.random_string.storage_account_random_string will be destroyed
  # (because random_string.storage_account_random_string is not in configuration)
  - resource "random_string" "storage_account_random_string" {
      - id          = "v02j5hjiqnxv8eno9bgrtqbn" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "v02j5hjiqnxv8eno9bgrtqbn" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#Cloud-Native"
            "application"            = "pre-recorded-evidence"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#dts-pre-rec-evidence-tech"
            "environment"            = "staging"
            "managedBy"              = "Pre Recorded Evidence"
        }
        # (36 unchanged attributes hidden)

      ~ network_rules {
          ~ default_action             = "Allow" -> "Deny"
          ~ ip_rules                   = [
              - "82.44.92.214",
              + "86.179.180.2",
                # (48 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.ingestsa02_storage_account.random_string.storage_account_random_string will be destroyed
  # (because random_string.storage_account_random_string is not in configuration)
  - resource "random_string" "storage_account_random_string" {
      - id          = "9x4l2ou4uw7ckv3go4i35wzo" -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "9x4l2ou4uw7ckv3go4i35wzo" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                              = "preingestsastg"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#Cloud-Native"
            "application"            = "pre-recorded-evidence"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#dts-pre-rec-evidence-tech"
            "environment"            = "staging"
            "managedBy"              = "Pre Recorded Evidence"
        }
        # (36 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "82.44.92.214",
              + "86.179.180.2",
                # (48 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
        name                            = "pre-stg"
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ ip_rules                   = [
              + "80.44.26.160",
              + "86.179.180.2",
              - "90.243.1.130/32",
              - "90.247.65.225/32",
            ]
          ~ virtual_network_subnet_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/aks-00",
                # (4 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # module.key-vault.azurerm_key_vault_access_policy.developer[0] will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "developer" {
      ~ certificate_permissions = [
          - "List",
            "Get",
          - "GetIssuers",
          - "ListIssuers",
          + "List",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      ~ key_permissions         = [
          - "List",
            "Get",
          + "List",
        ]
      ~ secret_permissions      = [
          - "List",
            "Get",
          + "List",
        ]
      ~ storage_permissions     = [
          - "List",
          - "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            "List",
          - "Get",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
            "GetIssuers",
            "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b1fd4154-355f-4683-a795-d09cdb814d16"
      ~ key_permissions         = [
            "List",
          - "Get",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      ~ secret_permissions      = [
            "List",
          - "Get",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      ~ storage_permissions     = [
          - "List",
          - "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg|pre-stg"
        name                       = "pre-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#Cloud-Native"
            "application"            = "pre-recorded-evidence"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#dts-pre-rec-evidence-tech"
            "environment"            = "staging"
            "managedBy"              = "Pre Recorded Evidence"
        }
        # (36 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "82.44.92.214",
              + "86.179.180.2",
                # (48 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.vm_automation.azurerm_automation_schedule.vm-start-stop["vm-off"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "vm-start-stop" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-schedule-stop-vm-18-00-00"
        name                    = "pre-schedule-stop-vm-18-00-00"
      ~ start_time              = "2022-11-03T18:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.vm_automation.azurerm_automation_schedule.vm-start-stop["vm-on"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "vm-start-stop" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-schedule-start-vm-06-00-00"
        name                    = "pre-schedule-start-vm-06-00-00"
      ~ start_time              = "2022-11-03T06:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop["vm-off"] will be destroyed
  # (because azurerm_automation_schedule.vm-start-stop is not in configuration)
  - resource "azurerm_automation_schedule" "vm-start-stop" {
      - automation_account_name = "pre-stg-aa" -> null
      - description             = "Schedule to stop vm at 18:00:00" -> null
      - expiry_time             = "9999-12-31T23:59:00Z" -> null
      - frequency               = "Day" -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-dtgtwy-schedule-stop-vm-18-00-00" -> null
      - interval                = 1 -> null
      - name                    = "pre-dtgtwy-schedule-stop-vm-18-00-00" -> null
      - resource_group_name     = "pre-stg" -> null
      - start_time              = "2022-11-03T18:00:00Z" -> null
      - timezone                = "Europe/London" -> null
    }

  # module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop["vm-on"] will be destroyed
  # (because azurerm_automation_schedule.vm-start-stop is not in configuration)
  - resource "azurerm_automation_schedule" "vm-start-stop" {
      - automation_account_name = "pre-stg-aa" -> null
      - description             = "Schedule to start vm at 06:00:00" -> null
      - expiry_time             = "9999-12-31T23:59:00Z" -> null
      - frequency               = "Day" -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-dtgtwy-schedule-start-vm-06-00-00" -> null
      - interval                = 1 -> null
      - name                    = "pre-dtgtwy-schedule-start-vm-06-00-00" -> null
      - resource_group_name     = "pre-stg" -> null
      - start_time              = "2022-11-03T06:00:00Z" -> null
      - timezone                = "Europe/London" -> null
    }

Plan: 39 to add, 14 to change, 9 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_managed_disk.dtgtwaydatadisk[0] has been deleted
  - resource "azurerm_managed_disk" "dtgtwaydatadisk" {
      - create_option                 = "Empty" -> null
      - disk_encryption_set_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/PRE-STG/providers/Microsoft.Compute/diskEncryptionSets/pre-des" -> null
      - disk_iops_read_only           = 0 -> null
      - disk_iops_read_write          = 500 -> null
      - disk_mbps_read_only           = 0 -> null
      - disk_mbps_read_write          = 60 -> null
      - disk_size_gb                  = 1000 -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/predtgtwy0-datadisk-stg" -> null
      - location                      = "uksouth" -> null
      - max_shares                    = 0 -> null
      - name                          = "predtgtwy0-datadisk-stg" -> null
      - on_demand_bursting_enabled    = false -> null
      - public_network_access_enabled = true -> null
      - resource_group_name           = "pre-stg" -> null
      - storage_account_type          = "Standard_LRS" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - trusted_launch_enabled        = false -> null
      - zone                          = "2" -> null
    }

  # azurerm_managed_disk.dtgtwaydatadisk[1] has been deleted
  - resource "azurerm_managed_disk" "dtgtwaydatadisk" {
      - create_option                 = "Empty" -> null
      - disk_encryption_set_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/PRE-STG/providers/Microsoft.Compute/diskEncryptionSets/pre-des" -> null
      - disk_iops_read_only           = 0 -> null
      - disk_iops_read_write          = 500 -> null
      - disk_mbps_read_only           = 0 -> null
      - disk_mbps_read_write          = 60 -> null
      - disk_size_gb                  = 1000 -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/predtgtwy1-datadisk-stg" -> null
      - location                      = "uksouth" -> null
      - max_shares                    = 0 -> null
      - name                          = "predtgtwy1-datadisk-stg" -> null
      - on_demand_bursting_enabled    = false -> null
      - public_network_access_enabled = true -> null
      - resource_group_name           = "pre-stg" -> null
      - storage_account_type          = "Standard_LRS" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - trusted_launch_enabled        = false -> null
      - zone                          = "2" -> null
    }

  # azurerm_network_interface.dtgwnic[0] has changed
  ~ resource "azurerm_network_interface" "dtgwnic" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/pre-dtgwnic0-stg"
      - internal_domain_name_suffix   = "fruoojhui1cejntjhgup5ozttg.zx.internal.cloudapp.net" -> null
        name                          = "pre-dtgwnic0-stg"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
      - virtual_machine_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/predtgtwy0-stg" -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_interface.dtgwnic[1] has been deleted
  - resource "azurerm_network_interface" "dtgwnic" {
      - applied_dns_servers           = [] -> null
      - dns_servers                   = [] -> null
      - enable_accelerated_networking = false -> null
      - enable_ip_forwarding          = false -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/pre-dtgwnic1-stg" -> null
      - internal_domain_name_suffix   = "fruoojhui1cejntjhgup5ozttg.zx.internal.cloudapp.net" -> null
      - location                      = "uksouth" -> null
      - mac_address                   = "60-45-BD-C1-28-6B" -> null
      - name                          = "pre-dtgwnic1-stg" -> null
      - private_ip_address            = "10.101.0.197" -> null
      - private_ip_addresses          = [
          - "10.101.0.197",
        ] -> null
      - resource_group_name           = "pre-stg" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - virtual_machine_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/predtgtwy1-stg" -> null

      - ip_configuration {
          - name                          = "internal" -> null
          - primary                       = true -> null
          - private_ip_address            = "10.101.0.197" -> null
          - private_ip_address_allocation = "Dynamic" -> null
          - private_ip_address_version    = "IPv4" -> null
          - subnet_id                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg" -> null
        }
    }

  # azurerm_windows_virtual_machine.dtgtwyvm[0] has been deleted
  - resource "azurerm_windows_virtual_machine" "dtgtwyvm" {
      - admin_password                = (sensitive value)
      - admin_username                = "Dtgtwy0_0Rjq" -> null
      - allow_extension_operations    = true -> null
      - availability_set_id           = "" -> null
      - capacity_reservation_group_id = "" -> null
      - computer_name                 = "PREDTGTW00-stg" -> null
      - dedicated_host_group_id       = "" -> null
      - dedicated_host_id             = "" -> null
      - edge_zone                     = "" -> null
      - enable_automatic_updates      = true -> null
      - encryption_at_host_enabled    = true -> null
      - eviction_policy               = "" -> null
      - extensions_time_budget        = "PT1H30M" -> null
      - hotpatching_enabled           = false -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/predtgtwy0-stg" -> null
      - license_type                  = "" -> null
      - location                      = "uksouth" -> null
      - max_bid_price                 = -1 -> null
      - name                          = "predtgtwy0-stg" -> null
      - network_interface_ids         = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/pre-dtgwnic0-stg",
        ] -> null
      - patch_assessment_mode         = "ImageDefault" -> null
      - patch_mode                    = "AutomaticByOS" -> null
      - platform_fault_domain         = -1 -> null
      - priority                      = "Regular" -> null
      - private_ip_address            = "10.101.0.196" -> null
      - private_ip_addresses          = [
          - "10.101.0.196",
        ] -> null
      - provision_vm_agent            = true -> null
      - proximity_placement_group_id  = "" -> null
      - public_ip_address             = "" -> null
      - public_ip_addresses           = [] -> null
      - resource_group_name           = "pre-stg" -> null
      - secure_boot_enabled           = false -> null
      - size                          = "Standard_F8s_v2" -> null
      - source_image_id               = "" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - timezone                      = "GMT Standard Time" -> null
      - user_data                     = "" -> null
      - virtual_machine_id            = "89790435-778f-41bc-b866-60cc3022df12" -> null
      - virtual_machine_scale_set_id  = "" -> null
      - vtpm_enabled                  = false -> null
      - zone                          = "2" -> null

      - identity {
          - identity_ids = [
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi",
            ] -> null
          - principal_id = "47f86c3e-320d-4d37-8daa-81afb4b5e85c" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned, UserAssigned" -> null
        }

      - os_disk {
          - caching                   = "ReadWrite" -> null
          - disk_encryption_set_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/PRE-STG/providers/Microsoft.Compute/diskEncryptionSets/pre-des" -> null
          - disk_size_gb              = 127 -> null
          - name                      = "predtgtwy0-osdisk-stg" -> null
          - storage_account_type      = "Standard_LRS" -> null
          - write_accelerator_enabled = false -> null
        }

      - source_image_reference {
          - offer     = "WindowsServer" -> null
          - publisher = "MicrosoftWindowsServer" -> null
          - sku       = "2019-datacenter-gensecond" -> null
          - version   = "latest" -> null
        }
    }

  # azurerm_windows_virtual_machine.dtgtwyvm[1] has been deleted
  - resource "azurerm_windows_virtual_machine" "dtgtwyvm" {
      - admin_password                = (sensitive value)
      - admin_username                = "Dtgtwy1_X4PO" -> null
      - allow_extension_operations    = true -> null
      - availability_set_id           = "" -> null
      - capacity_reservation_group_id = "" -> null
      - computer_name                 = "PREDTGTW01-stg" -> null
      - dedicated_host_group_id       = "" -> null
      - dedicated_host_id             = "" -> null
      - edge_zone                     = "" -> null
      - enable_automatic_updates      = true -> null
      - encryption_at_host_enabled    = true -> null
      - eviction_policy               = "" -> null
      - extensions_time_budget        = "PT1H30M" -> null
      - hotpatching_enabled           = false -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/predtgtwy1-stg" -> null
      - license_type                  = "" -> null
      - location                      = "uksouth" -> null
      - max_bid_price                 = -1 -> null
      - name                          = "predtgtwy1-stg" -> null
      - network_interface_ids         = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/pre-dtgwnic1-stg",
        ] -> null
      - patch_assessment_mode         = "ImageDefault" -> null
      - patch_mode                    = "AutomaticByOS" -> null
      - platform_fault_domain         = -1 -> null
      - priority                      = "Regular" -> null
      - private_ip_address            = "10.101.0.197" -> null
      - private_ip_addresses          = [
          - "10.101.0.197",
        ] -> null
      - provision_vm_agent            = true -> null
      - proximity_placement_group_id  = "" -> null
      - public_ip_address             = "" -> null
      - public_ip_addresses           = [] -> null
      - resource_group_name           = "pre-stg" -> null
      - secure_boot_enabled           = false -> null
      - size                          = "Standard_F8s_v2" -> null
      - source_image_id               = "" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - timezone                      = "GMT Standard Time" -> null
      - user_data                     = "" -> null
      - virtual_machine_id            = "c0e4d12d-cd1d-42d3-834d-6b1ad5f6fb53" -> null
      - virtual_machine_scale_set_id  = "" -> null
      - vtpm_enabled                  = false -> null
      - zone                          = "2" -> null

      - identity {
          - identity_ids = [
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pre-stg-mi",
            ] -> null
          - principal_id = "69011e13-9e27-4754-a953-99389bdcf09e" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned, UserAssigned" -> null
        }

      - os_disk {
          - caching                   = "ReadWrite" -> null
          - disk_encryption_set_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/PRE-STG/providers/Microsoft.Compute/diskEncryptionSets/pre-des" -> null
          - disk_size_gb              = 127 -> null
          - name                      = "predtgtwy1-osdisk-stg" -> null
          - storage_account_type      = "Standard_LRS" -> null
          - write_accelerator_enabled = false -> null
        }

      - source_image_reference {
          - offer     = "WindowsServer" -> null
          - publisher = "MicrosoftWindowsServer" -> null
          - sku       = "2019-datacenter-gensecond" -> null
          - version   = "latest" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":222,"Program":"tfcmt","SHA1":"","Vars":{}} -->